In [1]:
!pip install ipython-sql
%load_ext sql
import os
USER = os.environ['POSTGRESQL_USER']
PASSWORD = os.environ['POSTGRESQL_PASSWORD']
POSTGRESQL_HOST = '10.129.0.25'
DBASE_NAME = 'demo'
CONNECT_DATA = 'postgresql://{}:{}@{}/{}'.format(
    USER,
    PASSWORD,
    POSTGRESQL_HOST,
    DBASE_NAME
)

Requirement already satisfied: ipython-sql in /opt/conda/lib/python3.10/site-packages (0.5.0)
Requirement already satisfied: sqlalchemy>=2.0 in /opt/conda/lib/python3.10/site-packages (from ipython-sql) (2.0.7)
Requirement already satisfied: ipython in /opt/conda/lib/python3.10/site-packages (from ipython-sql) (8.11.0)
Requirement already satisfied: sqlparse in /opt/conda/lib/python3.10/site-packages (from ipython-sql) (0.4.4)
Requirement already satisfied: ipython-genutils in /opt/conda/lib/python3.10/site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: six in /opt/conda/lib/python3.10/site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: prettytable in /opt/conda/lib/python3.10/site-packages (from ipython-sql) (3.7.0)
Requirement already satisfied: greenlet!=0.4.17 in /opt/conda/lib/python3.10/site-packages (from sqlalchemy>=2.0->ipython-sql) (2.0.2)
Requirement already satisfied: typing-extensions>=4.2.0 in /opt/conda/lib/python3.10/site-packages (from sqlalchemy>=2.0->ipython-sql) (4.5.0)
Requirement already satisfied: jedi>=0.16 in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (0.18.2)
Requirement already satisfied: stack-data in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (0.6.2)
Requirement already satisfied: decorator in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: prompt-toolkit!=3.0.37,<3.1.0,>=3.0.30 in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (3.0.38)
Requirement already satisfied: pickleshare in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (0.7.5)
Requirement already satisfied: traitlets>=5 in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (5.9.0)
Requirement already satisfied: pexpect>4.3 in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (4.8.0)
Requirement already satisfied: pygments>=2.4.0 in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (2.14.0)
Requirement already satisfied: backcall in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: matplotlib-inline in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (0.1.6)
Requirement already satisfied: wcwidth in /opt/conda/lib/python3.10/site-packages (from prettytable->ipython-sql) (0.2.6)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in /opt/conda/lib/python3.10/site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.3)
Requirement already satisfied: ptyprocess>=0.5 in /opt/conda/lib/python3.10/site-packages (from pexpect>4.3->ipython->ipython-sql) (0.7.0)
Requirement already satisfied: executing>=1.2.0 in /opt/conda/lib/python3.10/site-packages (from stack-data->ipython->ipython-sql) (1.2.0)
Requirement already satisfied: pure-eval in /opt/conda/lib/python3.10/site-packages (from stack-data->ipython->ipython-sql) (0.2.2)
Requirement already satisfied: asttokens>=2.1.0 in /opt/conda/lib/python3.10/site-packages (from stack-data->ipython->ipython-sql) (2.2.1)
WARNING: There was an error checking the latest version of pip.

In [2]:
%%sql $CONNECT_DATA
SELECT distinct arrival_airport, aircraft_code FROM flights f
WHERE f.arrival_airport='AER'

7 rows affected.

[('AER', '773'),
 ('AER', '733'),
 ('AER', '763'),
 ('AER', 'CN1'),
 ('AER', 'SU9'),
 ('AER', 'CR2'),
 ('AER', '319')]

**â„–1 Which fare conditions are available for flights from AER to SVO (i.e. from Adler/Sochi to Sheremetevo/Moscow)**

In [ ]:
#Solution without JOINS

In [3]:
%%sql $CONNECT_DATA
    SELECT distinct fare_conditions as Available_fare_conditions_from_AER_to_SVO 
    FROM Ticket_flights 
    WHERE flight_id in (SELECT flight_id FROM Flights
    WHERE departure_airport = 'AER' and arrival_airport = 'SVO')

3 rows affected.

[('Business',), ('Comfort',), ('Economy',)]

In [ ]:
#Solution with JOINS

In [4]:
%%sql $CONNECT_DATA
    SELECT distinct departure_airport, arrival_airport, fare_conditions as Available_fare_conditions_from_AER_to_SVO 
    FROM Ticket_flights JOIN
    (SELECT departure_airport, arrival_airport, flight_id FROM Flights
    WHERE departure_airport = 'AER' and arrival_airport = 'SVO') as n
    ON Ticket_flights.flight_id = n.flight_id

3 rows affected.

[('AER', 'SVO', 'Business'),
 ('AER', 'SVO', 'Comfort'),
 ('AER', 'SVO', 'Economy')]

**â„–2 A list of aircraft models which fly to the Yakutsk AND Abakan cities**

In [ ]:
#Solution without JOINS

In [40]:
%%sql $CONNECT_DATA
SELECT model as aircraft_models_which_fly_to_the_Yakutsk_AND_Abakan FROM
       Aircrafts
    WHERE aircraft_code in (SELECT distinct aircraft_code 
                            FROM Flights
                            WHERE arrival_airport = (SELECT distinct airport_code 
                                                      FROM Airports
                                                      WHERE city = 'Yakutsk'))
           AND
               aircraft_code in (SELECT distinct aircraft_code
                            FROM Flights
                            WHERE arrival_airport = (SELECT distinct airport_code 
                                                      FROM Airports
                                                      WHERE city = 'Abakan'))

1 rows affected.

[('Airbus A319-100',)]

In [ ]:
#Solution with JOINS

In [36]:
%%sql $CONNECT_DATA
    SELECT arrival_airport_Yakutsk, arrival_airport_Abakan, n.aircraft_code, model as aircraft_models_which_fly_to_the_Yakutsk_AND_Abakan
    FROM Aircrafts
    JOIN
     (SELECT arrival_airport_Yakutsk,arrival_airport_Abakan, a.aircraft_code FROM
     (SELECT distinct aircraft_code, arrival_airport as arrival_airport_Yakutsk 
                            FROM Flights
                            WHERE arrival_airport = (SELECT distinct airport_code 
                                                      FROM Airports
                                                      WHERE city = 'Yakutsk')) as a
           JOIN
                (SELECT distinct aircraft_code, arrival_airport as arrival_airport_Abakan 
                            FROM Flights
                            WHERE arrival_airport = (SELECT distinct airport_code 
                                                      FROM Airports
                                                      WHERE city = 'Abakan')) as b
            ON a.aircraft_code = b.aircraft_code) as n
        ON Aircrafts.aircraft_code = n.aircraft_code

1 rows affected.

[('YKS', 'ABA', '319', 'Airbus A319-100')]

**â„– 3 A list of aircraft models which fly to the Yakutsk OR Abakan cities**

In [ ]:
#Solution without JOINS

In [79]:
%%sql $CONNECT_DATA
    SELECT model as aircraft_models_which_fly_to_the_Yakutsk_OR_Abakan
    FROM Aircrafts
    WHERE aircraft_code in (SELECT distinct aircraft_code 
                            FROM Flights
                            WHERE arrival_airport = (SELECT distinct airport_code 
                                                      FROM Airports
                                                      WHERE city = 'Yakutsk'))
           OR
               aircraft_code in (SELECT distinct aircraft_code 
                            FROM Flights
                            WHERE arrival_airport = (SELECT distinct airport_code 
                                                      FROM Airports
                                                      WHERE city = 'Abakan'))

5 rows affected.

[('Sukhoi Superjet-100',),
 ('Airbus A319-100',),
 ('Boeing 737-300',),
 ('Cessna 208 Caravan',),
 ('Bombardier CRJ-200',)]

In [ ]:
#Solution with JOINS - NOTE: We cannot extarct the duplicate aircraft_code = 319 there because we have unique (distinct) 
#concationation of arrival_airport + aircraft code. We should either wipe out arrival airport from the output or accept a duplicate.

In [77]:
%%sql $CONNECT_DATA
        SELECT arrival_airport, n.aircraft_code, model as aircraft_models_which_fly_to_the_Yakutsk_OR_Abakan
    FROM Aircrafts
    JOIN
     (SELECT distinct aircraft_code, arrival_airport 
                            FROM Flights
                            WHERE arrival_airport = (SELECT distinct airport_code 
                                                      FROM Airports
                                                      WHERE city = 'Yakutsk') 
           UNION
                (SELECT distinct aircraft_code, arrival_airport
                            FROM Flights
                            WHERE arrival_airport = (SELECT distinct airport_code 
                                                      FROM Airports
                                                      WHERE city = 'Abakan'))) as n
        ON Aircrafts.aircraft_code = n.aircraft_code

6 rows affected.

[('ABA', '733', 'Boeing 737-300'),
 ('ABA', '319', 'Airbus A319-100'),
 ('ABA', 'CN1', 'Cessna 208 Caravan'),
 ('YKS', 'SU9', 'Sukhoi Superjet-100'),
 ('YKS', '319', 'Airbus A319-100'),
 ('YKS', 'CR2', 'Bombardier CRJ-200')]

**â„– 4 A list of aircrafts which DONâ€™T fly to Yakutsk city**

In [ ]:
#Solution without JOINS

In [78]:
%%sql $CONNECT_DATA
    SELECT model as aircraft_models_which_do_not_fly_to_Yakutsk
    FROM Aircrafts
    WHERE aircraft_code not in (SELECT distinct aircraft_code 
                            FROM Flights
                            WHERE arrival_airport = (SELECT distinct airport_code 
                                                      FROM Airports
                                                      WHERE city = 'Yakutsk'))

6 rows affected.

[('Boeing 777-300',),
 ('Boeing 767-300',),
 ('Airbus A320-200',),
 ('Airbus A321-200',),
 ('Boeing 737-300',),
 ('Cessna 208 Caravan',)]

In [ ]:
#additional check - A list of aircrafts which DO fly to Yakutsk city

In [84]:
%%sql $CONNECT_DATA
    SELECT model as aircraft_models_which_do_fly_to_Yakutsk
    FROM Aircrafts
    WHERE aircraft_code in (SELECT distinct aircraft_code 
                            FROM Flights
                            WHERE arrival_airport = (SELECT distinct airport_code 
                                                      FROM Airports
                                                      WHERE city = 'Yakutsk'))

3 rows affected.

[('Sukhoi Superjet-100',), ('Airbus A319-100',), ('Bombardier CRJ-200',)]

In [ ]:
#Solution with JOIN

In [8]:
%%sql $CONNECT_DATA
    SELECT f.aircraft_code, model as aircraft_models_which_do_not_fly_to_Yakutsk
    FROM Aircrafts
    FULL OUTER JOIN (SELECT distinct aircraft_code 
                            FROM Flights 
                                JOIN (SELECT distinct airport_code 
                                                      FROM Airports
                                                      WHERE city = 'Yakutsk') as g
                               ON Flights.arrival_airport = g.airport_code) as f
    ON Aircrafts.aircraft_code = f.aircraft_code

9 rows affected.

[(None, 'Boeing 777-300'),
 (None, 'Boeing 767-300'),
 ('SU9', 'Sukhoi Superjet-100'),
 (None, 'Airbus A320-200'),
 (None, 'Airbus A321-200'),
 ('319', 'Airbus A319-100'),
 (None, 'Boeing 737-300'),
 (None, 'Cessna 208 Caravan'),
 ('CR2', 'Bombardier CRJ-200')]

**â„– 5 Find out airport codes related to Mrs. 'ELLA DMITRIEVA'  - from where and to where she flew.**

In [ ]:
#Sloution without JOINS

In [77]:
%%sql $CONNECT_DATA
SELECT departure_airport as departure_airport_of_Ms_Ella_Dmitirieva, 
arrival_airport as arrival_airport_of_Ms_Ella_Dmitirieva
FROM Flights
WHERE flight_id in (SELECT flight_id 
                    FROM Ticket_flights
                    WHERE ticket_no in (SELECT ticket_no 
                                        FROM Tickets
                                        WHERE passenger_name = 'ELLA DMITRIEVA'))

7 rows affected.

[('SVO', 'SVX'),
 ('MQF', 'SVX'),
 ('SVX', 'MQF'),
 ('SVX', 'SVO'),
 ('DME', 'HMA'),
 ('DME', 'UUS'),
 ('HMA', 'DME')]

In [4]:
%%sql $CONNECT_DATA
SELECT departure_airport as departure_airport_of_Ms_Ella_Dmitirieva, 
arrival_airport as arrival_airport_of_Ms_Ella_Dmitirieva
FROM Flights f, Ticket_flights tf, Tickets t
WHERE f.flight_id = tf.flight_id 
AND tf.ticket_no = t.ticket_no
AND passenger_name = 'ELLA DMITRIEVA'

7 rows affected.

[('DME', 'HMA'),
 ('HMA', 'DME'),
 ('DME', 'UUS'),
 ('SVO', 'SVX'),
 ('SVX', 'SVO'),
 ('SVX', 'MQF'),
 ('MQF', 'SVX')]

In [5]:
%%sql $CONNECT_DATA
SELECT departure_airport as departure_airport_of_Ms_Ella_Dmitirieva, 
arrival_airport as arrival_airport_of_Ms_Ella_Dmitirieva
FROM Flights
JOIN Ticket_flights USING(flight_id)
JOIN Tickets USING(ticket_no)
WHERE passenger_name = 'ELLA DMITRIEVA'

7 rows affected.

[('DME', 'UUS'),
 ('SVO', 'SVX'),
 ('SVX', 'SVO'),
 ('SVX', 'MQF'),
 ('MQF', 'SVX'),
 ('DME', 'HMA'),
 ('HMA', 'DME')]

In [ ]:
#WOW, she travelled to my hometown (Magnitogorsk, MQF) even!

In [ ]:
#Solution with JOINS

In [3]:
%%sql $CONNECT_DATA
SELECT 
passenger_name, 
ticket_no_of_ELLA, 
t.flight_id,
departure_airport as departure_airport_of_Ms_Ella_Dmitirieva, 
arrival_airport as arrival_airport_of_Ms_Ella_Dmitirieva
FROM Flights
JOIN ((SELECT passenger_name, a.ticket_no as ticket_no_of_ELLA, flight_id 
                    FROM Ticket_flights
                    JOIN (SELECT passenger_name, ticket_no 
                                        FROM Tickets
                                        WHERE passenger_name = 'ELLA DMITRIEVA') as a
                    ON Ticket_flights.ticket_no = a.ticket_no)) as t
ON Flights.flight_id = t.flight_id

7 rows affected.

[('ELLA DMITRIEVA', '0005432284229', 8202, 'DME', 'UUS'),
 ('ELLA DMITRIEVA', '0005434344563', 34407, 'SVO', 'SVX'),
 ('ELLA DMITRIEVA', '0005433516547', 11445, 'DME', 'HMA'),
 ('ELLA DMITRIEVA', '0005433516547', 142605, 'HMA', 'DME'),
 ('ELLA DMITRIEVA', '0005434344563', 70804, 'SVX', 'SVO'),
 ('ELLA DMITRIEVA', '0005434344563', 74285, 'SVX', 'MQF'),
 ('ELLA DMITRIEVA', '0005434344563', 193132, 'MQF', 'SVX')]